Autodesk.Revit.DB.BuiltInFailures.ProfileFailures.SketchNotEmpty
Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.

Autodesk.Revit.DB.BuiltInFailures.ProfileFailures
Failures about Profile.